<?php 
// Heading
$_['heading_title']      = 'Поставщики v.6.3';
$_['heading_base_title'] = 'Обновление базы данных';


// Text
$_['text_settings']   	 = 'Фильтр';
$_['text_confirm']       = 'Удаление невозможно отменить! Вы уверены, что хотите это сделать?';
$_['text_myprice1']   	 = 'Всегда';
$_['text_myprice2']   	 = 'Цена возросла';
$_['text_myprice3']   	 = 'Цена снизилась';
$_['text_myprice4']   	 = 'Никогда';
$_['text_updte1']   	 = 'Никогда';
$_['text_updte2']   	 = 'Всегда';
$_['text_updte3']   	 = 'Если качественнее';
$_['text_status1']   	 = 'Есть в наличии';
$_['text_status2']   	 = 'Ожидание 2-3 дня';
$_['text_status3']   	 = 'Предзаказ';
$_['text_status4']   	 = 'Нет в наличии';
$_['text_module']        = 'Модули';
$_['text_success']       = 'Настройки обновлены!';
$_['text_base_success']  = 'Готово!';
$_['text_content_top']   = 'Верх страницы';
$_['text_content_bottom']= 'Низ страницы';
$_['text_column_left']   = 'Левая колонка';
$_['text_column_right']  = 'Правая колонка';
$_['text_clear']      	 = 'Очистить';
$_['text_browse']        = 'Обзор';
$_['text_no_results'] 	 = 'Ничего нет';
$_['text_default']       = 'Default';
$_['text_percent']       = 'Процент';
$_['text_amount']        = 'Фиксированная сумма';
$_['text_go']       	 = 'Старт';
$_['text_left']       	 = 'Стоящему в колонке слева или как спарсится';
$_['text_all']       	 = 'Неважно';
$_['text_act']       	 = 'Действие:';
$_['text_wse']       	 = 'Все';
$_['text_only']       	 = 'Только этот';
$_['text_ended']       	 = 'Закончился';
$_['text_dc']       	 = 'Неважно';
$_['tags_yes']   		 = 'Отобразить в Метках';
$_['tags_no']   		 = 'Не отображать';
$_['text_math1']   		 = 'Меньше минимальной';
$_['text_math2']   		 = 'Меньше средней';
$_['text_math3']   		 = 'Меньше максимальной';
$_['text_refer0']  		 = 'Из колонок прайса';
$_['text_refer1']  		 = 'Сохраненные в товаре';
$_['text_ad1']  		 = 'Добавлять и обновлять';
$_['text_ad0']  		 = 'Только обновлять';
$_['text_ad2']  		 = 'Обновить только остатки';
$_['text_ad3']  		 = 'Только добавлять';
$_['text_ad4']  		 = 'Обновить только цены';
$_['text_ad5']  		 = 'Создать категории';
$_['text_ad6']  		 = 'Создать стр. "Данные"';
$_['text_ad7']  		 = '"Данные" с папками для фото';
$_['text_ad8']  		 = 'Список похожих товаров';

$_['text_command0']    	 = 'Ничего не делать';
$_['text_command1']    	 = 'Применить множитель цены';
$_['text_command2']    	 = 'Установить статус "Есть в наличии"';
$_['text_command3']    	 = 'Установить статус "Ожидание 2-3 дня"';
$_['text_command4']    	 = 'Установить статус "Предзаказ"';
$_['text_command5']    	 = 'Установить статус "Нет в наличии"';
$_['text_command6']    	 = 'Установить количество на складе 99';
$_['text_command7']    	 = 'Показывать также и в целевой категории';
$_['text_command8']    	 = 'Показывать только в категории, указанной в фильтре';
$_['text_command9']    	 = 'Включить товары';
$_['text_command10']   	 = 'Отключить товары';
$_['text_command11']   	 = 'Удалить товары';
$_['text_command12']   	 = 'Экспорт';
$_['text_command13']   	 = 'Установить количество на складе 0';
$_['text_command14']   	 = 'Освободить дубли атрибутов для удаления';
$_['text_command15']   	 = 'Преобразовать описания';
$_['text_command16']   	 = 'Удалить дубли фото в товаре';
$_['text_command17']   	 = 'Исправить meta-данные товаров';
$_['text_command18']   	 = 'Создать или пополнить Библиотеку sku';
$_['text_command19']   	 = 'Удалить товары без атрибутов';
$_['text_command20']   	 = 'Найти и заменить в значениях атрибутов';
$_['text_command21']   	 = 'Найти и заменить в описаниях';
$_['text_command22']   	 = 'Доставка допустима';
$_['text_command23']   	 = 'Доставка недопустима';
$_['text_command24']   	 = 'Найти и заменить в названии';
$_['text_command25']   	 = 'Вывести атрибуты для корректировки';
$_['text_command26']   	 = 'Загрузить исправленные атрибуты';
$_['text_command27']   	 = 'Удалить неиспользуемые фото';
$_['text_command28']   	 = 'Изменить sku: Поле1+sku+Поле2';
$_['text_command29']   	 = 'Вывести список связанных SKU';
$_['text_command30']   	 = 'Вывести дубли товаров';
$_['text_command31']   	 = 'Исправить url и meta-данные категорий';
$_['text_command32']   	 = 'Исправить url и meta-данные производителей';
$_['text_command33']   	 = 'Удалить акционные цены';
$_['text_command34']   	 = 'Исправить url товаров';
$_['text_command35']   	 = 'Найти и заменить в Title';
$_['text_command36']   	 = 'Найти и заменить в H1';
$_['text_command37']   	 = 'Найти и заменить в meta-description';
$_['text_command38']   	 = 'Разложить фото по под-папкам [0],[1]...[9]';
$_['text_command39']   	 = 'Удалить описания, короче Поле1 символов';
$_['text_command40']   	 = 'Установить минимальный заказ из Поле1';
// Tabs
$_['tab_attribute']      = 'Атрибуты';
$_['tab_option']     	 = 'Опции';
$_['tab_action']      	 = 'Инструменты';
$_['tab_price']      	 = 'Цены';

// Entry
$_['entry_data']    	 = 'Создать страницу "Данные" по прайсу:';
$_['entry_fields']    	 = 'Номера колонок, содержащих другие артикулы:';
$_['entry_newurl1']    	 = 'импортировать из кол. 28';
$_['entry_newurl0']    	 = 'формировать из названия';
$_['entry_newurl']    	 = 'Создать url новых товаров:';
$_['entry_site_nom']  	 = 'Номер колонки, содержащей ссылку на страницу сайта:';
$_['entry_site_ident']   = 'Любой текст:';
$_['entry_site_param']   = 'Параметры парсинга:';
$_['entry_site_point']   = 'Точка отсчета:';
$_['entry_site_math']    = 'Расчитать цену:';
$_['entry_onn']    		 = 'на:';
$_['entry_refer']    	 = 'Использовать ссылки:';
$_['entry_disc']    	 = 'Скидка %:';
$_['entry_suppler_id']	 = '<strong>Префикс поставщика</strong>:';
$_['entry_stay']  		 = 'Сделать его основным:';
$_['entry_joen']  		 = 'Связать sku:';
$_['entry_catcreate']  	 = 'Создать категории:';
$_['entry_pars']   	 	 = 'Номер колонки, содержащей ссылку для парсинга:';
$_['entry_place']   	 = 'Количество повторений (вхождений):';
$_['entry_point']   	 = 'текста, c которого начается парсинг:';
$_['entry_point1']   	 = 'Текст начала парсинга:';
$_['entry_chcode']   	 = 'Преобразовать Модель в Код товара:';
$_['entry_minus']   	 = 'Вычитать со склада:';
$_['entry_cprice']   	 = 'Использовать формулу зависимости маржи от цены:';
$_['entry_myplus'] 		 = 'Номер колонки, содержащей % <font color="#88370f"><strong>наценки</strong></font>:';
$_['entry_upname']   	 = 'Обновлять название товара:<br/>(см. ниже "Обновить url")';
$_['entry_upopt']   	 = 'Обновлять данные опций:';
$_['entry_upopt0']   	 = 'нет';
$_['entry_upopt1']   	 = 'если есть в прайсе';
$_['entry_upopt2']   	 = 'и обнулять отсутствующие';
$_['entry_addopt0']   	 = 'нет';
$_['entry_addopt1']   	 = 'и не связывать их';
$_['entry_addopt2']   	 = 'и связывать их';
$_['entry_upurl0']   	 = 'нет';
$_['entry_upurl1']   	 = 'формировать из названия';
$_['entry_upurl2']   	 = 'импортировать из кол. 28';
$_['entry_offproduct']   = 'Товар включен:';
$_['entry_offproduct0']   = 'Неважно';
$_['entry_offproduct1']   = 'Да';
$_['entry_offproduct2']   = 'Нет';
$_['entry_upattr']   	 = 'Атрибуты в товаре:';
$_['entry_upattr0']   	 = 'нет';
$_['entry_upattr1']   	 = 'удалить и создать заново';
$_['entry_upattr2']   	 = 'обновить, создать, добавить';
$_['entry_upattr3']   	 = 'обновить, добавить, не создавать';
$_['entry_upattr4']   	 = 'только обновить';
$_['entry_addattr']   	 = 'Ссылки на фото категорий - в колонке 29:';
$_['entry_exsame']   	 = 'Создать список похожих товаров:';
$_['entry_pmanuf']   	 = 'Создавать в магазине:';
$_['entry_umanuf']   	 = 'Обновлять в товаре:';
$_['entry_updte']   	 = 'Обновлять описание:';
$_['entry_related']   	 = 'Номер колонки, содержащей sku;sku;sku... <font color="#88370f"><strong>похожих</strong></font> товаров:';
$_['entry_order']   	 = 'Номер колонки, содержащей порядок <font color="#88370f"><strong>сортировки</strong></font>:';
$_['entry_spec']   	 	 = 'Номер колонки, содержащей <font color="#88370f"><strong>акционную цену</strong></font>:';
$_['entry_ref']   	 	 = 'Номер колонки для Бренда, Модели и пр.:';
$_['entry_addseo']   	 = 'Создать/Обновить meta-данные:';
$_['entry_addseo0']   	 = 'нет';
$_['entry_addseo1']   	 = 'по шаблону';
$_['entry_addseo2']   	 = 'импортировать из колонок 23-27';
$_['entry_upurl']   	 = 'Обновить url:';
$_['entry_importseo']  	 = 'Игнорировать маржу:';
$_['entry_addopt']   	 = 'Создавать значения опций:';
$_['entry_sku2']   		 = 'Номер колонки, содержащей <font color="#88370f"><strong>альтернативный sku</strong></font>:';
$_['entry_we']   		 = '"Вес":';
$_['entry_pr']   		 = '"+ к цене":';
$_['entry_ko']   		 = '"Количество":';
$_['entry_po']   		 = '"Бонус":';
$_['entry_option_required']	 = 'Обязательная:';
$_['entry_option']   	 = 'Выберите Опцию и номера колонок в прайс-листе:';
$_['entry_opt']   		 = '"Значение":';
$_['entry_all']   		 = 'Поставщики:';
$_['entry_tags']   		 = 'Показывать в Метках:';
$_['entry_newphoto']   	 = 'Обновлять фото и добавлять доп. фото:';
$_['entry_hide']       	 = 'Добавлять, как "Включенные":';
$_['entry_parent']       = 'Показывать в родительской категории:';
$_['entry_any']   	 	 = ' 0 - неважно';
$_['entry_actmult']   	 = 'Множитель цены:';
$_['entry_attribut']   	 = 'Товар имеет атрибут:';
$_['entry_noattribut']   = 'Товар не имеет атрибута:';
$_['entry_off']   		 = 'Выключить, если остаток 0:';
$_['entry_find']   		 = 'Поле1/Найти:';
$_['entry_change']   	 = 'Поле2/Заменить на:';
$_['entry_actsuppler']   = 'Поставщик:';
$_['entry_last']   	 	 = '1000000';
$_['entry_first']   	 = '1';
$_['entry_cod_from']   	 = 'Номер товара (без кода поставщика) "от":';
$_['entry_cod_to']   	 = 'Номер товара "до":';
$_['entry_date_end']   	 = 'Период "до":';
$_['entry_date_start']   = 'Товар обновлялся в период (включительно) "с":';
$_['entry_actmanuf']  	 = 'Производитель товара:';
$_['entry_actcat']  	 = 'Категория:';
$_['entry_zactcat']  	 = 'Целевая категория:';
$_['entry_kol']  	 	 = 'Товар на складе:';
$_['entry_dimension']  	 = 'Номера колонок, содержащих <font color="#88370f"><strong>размеры</strong></font> товара:';
$_['entry_weight']  	 = 'Номер колонки, содержащей <font color="#88370f"><strong>массу</strong></font> товара:';
$_['entry_mymark']  	 = 'Ключевые слова (по умолчанию - имя производителя):';
$_['entry_mymanuf']  	 = 'Производитель по умолчанию:';
$_['entry_mydescrip']  	 = 'Описание по умолчанию:';
$_['entry_myphoto']  	 = 'Прямая ссылка на фото по умолчанию:';
$_['entry_myprice']    	 = 'Корректировать цену, если:';
$_['entry_myqu']   	 	 = 'Количество по умолчанию или текст=число,текст=число..:';
$_['entry_mycat']   	 = 'Категория по умолчанию:';
$_['entry_cheap']   	 = 'Установить цену, на основании анализа цен конкурентов:';
$_['entry_set_status']   = 'Статус при нулевом остатке:';
$_['entry_attrib']		 = 'Номер колонки, содержащей значение атрибута или параметры парсинга:';
$_['entry_attribute']	 = 'Соответствует атрибуту:';
$_['entry_layout']       = 'Схема:';
$_['entry_position']     = 'Расположение:';
$_['entry_status']       = 'Статус:';
$_['entry_name']         = '<strong>Поставщик</strong>:';
$_['entry_rate']         = 'Курс (по умолчанию 1.000):';
$_['entry_sort_order']   = 'Порядок сортировки:';
$_['entry_add']          = '<font color="#003a88"><h1>Действие:</h1></font>';
$_['entry_cat_ext']      = 'Название категории в прайс-листе:';
$_['entry_cat_int']      = 'Соответствует вашей категории:';
$_['entry_cat_plus']     = 'Фиксированная маржа на категорию (% к цене):<br />или по диапазонам (1-50)8.5,(50-100)5.2 и т.д';
$_['entry_cod']          = 'Номер колонки в прайс листе, содержащей <font color="#88370f"><strong>артикул (sku)</strong></font> или параметры парсинга:';
$_['entry_item']         = 'Номер колонки, содержащей <font color="#88370f"><strong>название</strong></font> товара или параметры парсинга:';
$_['entry_cat']          = 'Номер(а) колонки(ок), содержащей <font color="#88370f"><strong>категорию</strong></font> товара или параметры парсинга:';
$_['entry_qu']           = 'Номер(а) колонки(ок), содержащей <font color="#88370f"><strong>количество</strong></font> товара:';
$_['entry_price']        = 'Номера колонок, содержащих <font color="#88370f"><strong>цену и спец. цены </strong></font>, через запятую или параметры парсинга:';
$_['entry_desc']         = 'Номер колонки, содержащей <font color="#88370f"><strong>описание</strong></font> товара или параметры парсинга:';
$_['entry_pic_ext']      = 'Номера колонок, содержащих прямые ссылки на <font color="#88370f"><strong>фото</strong></font> товара, через запятую: &nbsp;&nbsp;&nbsp;&nbsp;<strong>или</strong>';
$_['entry_pic_int']      = 'Существующая папка для загрузки фото товара (без image/data/):';
$_['entry_manuf']        = 'Номер колонки, содержащей имя <font color="#88370f"><strong>производителя</strong></font> или параметры парсинга:';
$_['entry_warranty']     = 'Количество повторений (вхождений) ключевых слов и знак правее/левее (>1,<3,...):';
$_['entry_def_word']     = '(по умолчанию - имя производителя)';
$_['entry_description']  = '<b>Сохраните форму поставщика, если вы внесли в нее изменения.</b><br/> <br/>1.Каждая строка таблицы Excel должна обязательно содержать: <br/> - название категории товара, как ее определил поставщик, <br/> - код товара присвоенный поставщиком или артикул (sku), <br/> - цену товара от поставщика, <br/> - ссылку на фото товара или на сайт поставщика, если вы хотите добавлять товары. <br/><br/>2.Форма должна обязательно содержать: <br/> - номер колонки в прайс-листе, в которой находится код товара поставщика(sku), <br/> - номер колонки в прайс-листе, в которой находится название категории товара, как ее определил поставщик, <br/> - номер колонки в прайс-листе, в которой находится цена товара, <br/> - номер колонки в прайс-листе, в которой находится ссылка на фото товара или на сайт поставщика, если вы хотите добавлять товары. <br/>Колонка с ценой должна быть в числовом формате и в ней не должны встречаться числа, имеющие иной смысл <b>на всем протяжении таблицы</b> (например, сумма). <br/><br/>

Сконвертируйте XLS файл в XML, любой стандартной программой.<br/>
Выберите подготовленный XML файл.<br/>
Нажмите кнопку "Старт/Продолжение". <br/>
У всех товаров, которые уже есть в базе скорректируется только те поля, которые вы разрешили корректировать.<br/>
Цена скорректируется с учетом курса и вашей наценки, в зависимости от категории товара.<br/>
Новый товар будет добавлен только в том случае, если: <br/>
 - вы это разрешили и<br/>
 - товар имеет sku, которого в базе нет.<br/><br/>
 
Если сервер прервет работу программы (time limit), повторяйте процесс столько раз, сколько необходимо до появления сообщения:<br/>
"Готово!"<br/>
Просесс будет продолжен с того места, где был прерван. Контрольная точка находится в файле admin/uploads/sos.tmp<br/>
Удалите этот файл, если вы не хотите продолжать обновление товаров от этого поставщика.<br/>
Причины по которым товар не был добавлен в базу, вы сможете узнать, просмотрев файл admin/uploads/errors.tmp <br/>

<br/><br/>
P.S. <i>Для кода товара в вашем магазине используется поле "Модель", для кода товара поставщика или артикула товара - поле "SKU".<br/>
Ваш код товара формируется автоматически. К нему, через дефис, добавляются две цифры номера поставщика.</i>';
$_['entry_restore']  	 = 'Файл в формате XML:';

// Button
$_['button_update']      = 'Обновить';
$_['button_insert']      = 'Добавить';
$_['button_delete']      = 'Удалить';
$_['button_base']        = 'СТАРТ';
$_['button_start']       = 'Старт / Продолжение';

// Column
$_['column_title']       = 'Поставщики';
$_['column_name']        = 'Поставщик';
$_['column_sort_order']  = 'Порядок сортировки';
$_['column_scode']   	 = 'Код поставщика:';
$_['column_action']      = 'Действие';

// Error
$_['error_attribute'] 	 = 'Невозможно открыть файл admin/uploads/attribute.tmp';
$_['error_con']    		 = 'Невозможно открыть файл admin/uploads/conv.xml';
$_['error_ex']    		 = 'Невозможно открыть файл admin/uploads/ex.xml';
$_['error_uploads']    	 = 'Создайте папку admin/uploads';
$_['error_attribute']    = 'Введите соответствующий атрибут';
$_['error_permission']   = 'У Вас нет прав для управления этим модулем!';
$_['error_name']         = 'От 1 до 64 символов!';
$_['error_suppler']      = 'Укажите Код поставщика!';
$_['error_format']       = 'Файл имеет недопустимый формат или имя!';
$_['error_vol']          = 'Файл имеет недопустимый размер!';
$_['error_open']       	 = 'Загруженный файл не открывается!';
$_['error_xml']       	 = 'XML не был сконвертирован из XLS файла!';
$_['error_sos']       	 = 'Невозможно создать файл admin/uploads/sos.tmp или errors.tmp!';
$_['error_bad_sos']      = 'Удалите файл admin/uploads/sos.tmp, повторите операцию!';
$_['error_rate']    	 = 'Проверьте настройки формы. Курс валюты. Здесь должно быть число!';
$_['error_cod']     	 = 'Проверьте настройки формы. Графа Артикул не может быть пустой!';
$_['error_pers']     	 = 'Проверьте настройки формы. Процент наценки. Здесь должно быть число - номер колонки в прайс-листе!';
$_['error_weight']     	 = 'Проверьте настройки формы. Масса товара. Здесь должно быть число - номер колонки в прайс-листе!';
$_['error_qu']     	 	 = 'Проверьте настройки формы. Количество товара. Здесь должно быть число - номер колонки в прайс-листе!';
$_['error_dim']     	 = 'Проверьте настройки формы. Размеры товара. Здесь должны быть числа - номера колонок в прайс-листе!';
$_['error_related']    	 = 'Проверьте настройки формы. Похожие товары. Здесь должно быть число!';
$_['error_pic']      	 = 'Проверьте настройки формы. Ссылка на фото товара. Здесь должно быть число или числа через запятую!';
$_['error_pars']     	 = 'Проверьте настройки формы. В графе "Ссылка для парсинга" должно быть число - номер колонки в прайс-листе!';
$_['error_warranty']   	 = 'Проверьте настройки формы. Место расположения фото товара, должно быть число со знаком < или > или числа через запятую!';
$_['error_site']   	 	 = 'Проверьте настройки формы. Вы можете указать только одну страницу сайта!';
$_['error_item']     	 = 'Проверьте настройки формы. Графа Название товара не может быть пустой!';
$_['error_cat']      	 = 'Проверьте настройки формы на странице Данные. Соответствующая категория где-то пропущена!';
$_['error_price']      	 = 'Проверьте настройки формы. Графа "Цена" не может быть пустой!';
$_['error_add']      	 = 'Ваши настройки не позволяют добавлять товары. Вы разрешили добавлять, но не указали, в какой колонке прайса находится ссылка на фото товара!';
$_['error_data']      	 = 'Заполните форму на странице "Данные"!';
$_['error_folder']     	 = 'Не указана папка для размещения фото товара на странице "Данные"!';
$_['error_attribute']    = 'Не выбран атрибут на странице "Атрибуты"!';
$_['error_file']    	 = 'Загруженный файл пуст!';
$_['error_empty']    	 = 'Не заданы настройки на странице "Инструменты"!';
$_['error_set_category'] = 'В фильтре необходимо установить категорию!';
$_['error_create_folder'] = 'Создайте копию папки image со всей структурой папок, но пустых. Назовите ее image1';
?>